Repository: ctt-gob-es/firma-ios
Catalog: Firma_iOS/Accessibility/Accessibility.xcstrings
Source language: en
Languages: ca, es, eu, gl

# add_certificate.password.textfield.label
source: Password of the certificate to add
ca: Contrasenya del certificat a afegir
es: Contraseña del certificado a añadir
eu: Gehitzeko ziurtagiriaren pasahitza
gl: Contrasinal do certificado a engadir

# annotations.close_discard.label
source: Close without signing
ca: Tancar sense signar
es: Cerrar sin firmar
eu: Itxi sinatu gabe
gl: Pechar sen asinar

# annotations.confirm.label
source: Accept and sign
ca: Acceptar i signar
es: Aceptar y firmar
eu: Onartu eta sinatu
gl: Aceptar e asinar

# annotations.reset.label
source: Delete selected signature area
ca: Esborrar àrea seleccionada de signatura
es: Borrar área seleccionada de firma
eu: Ezabatu hautatutako sinadura eremua
gl: Borrar área seleccionada de sinatura

# ax.option_button
source: Option Button
ca: Botó d'opció
es: Botón de opción
eu: Aukera botoia
gl: Botón de opción

# button_delete_certificate
source: Delete electronic certificate: %@
ca: Eliminar certificat electrònic: %@
es: Eliminar certificado electrónico: %@
eu: Ziurtagiri elektronikoa ezabatu: %@
gl: Eliminar certificado electrónico: %@

# can.textfield.label
source: DNI CAN code
ca: Codi CAN del DNI
es: Código del CAN del DNI
eu: NANaren CAN kodea
gl: Código CAN do DNI

# checkbox.state.checked
source: Accepted
ca: Acceptat
es: Aceptado
eu: Onartua
gl: Aceptado

# checkbox.state.unchecked
source: Not accepted
ca: No acceptat
es: No aceptado
eu: Ez onartua
gl: Non aceptado

# dni_scan_view.image.label
source: Place the mobile device aligned with the DNI chip, so that the document slightly protrudes from the top of the phone to facilitate chip reading
ca: Col·loca el dispositiu mòbil alineat amb el xip del DNI, de manera que el document sobresurti lleugerament per la part superior del telèfon per facilitar la lectura del xip
es: Coloca el dispositivo móvil alineado con el chip del DNI, de forma que el documento sobresalga ligeramente por la parte superior del teléfono para facilitar la lectura del chip
eu: Jarri gailu mugikorra NAN txartelaren txiparekin lerrokatuta, dokumentua telefonoaren goiko aldetik pixka bat irtenda gera dadin, txiparen irakurketa errazteko
gl: Coloca o dispositivo móbil aliñado co chip do DNI, de forma que o documento sobresaía lixeiramente pola parte superior do teléfono para facilitar a lectura do chip

# document.password.textfield.label
source: Document password
ca: Contrasenya del document
es: Contraseña del documento
eu: Dokumentuaren pasahitza
gl: Contrasinal do documento

# ED2026.image.label
source: Digital Spain 2026
ca: Espanya digital 2026
es: España digital 2026
eu: Espainia Digitala 2026
gl: España Dixital 2026

# ES_Financiado_UE.image.label
source: Funded by the European Union NextGenerationEU
ca: Finançat per la Unió Europea NextGenerationEU
es: Financiado por la Unión Europea NextGenerationEU
eu: Europar Batasunak finantzatua NextGenerationEU
gl: Financiado pola Unión Europea NextGenerationEU

# go_back_to_can.button.label
source: Go back to CAN input step
ca: Tornar al pas d'introduir CAN
es: Volver al paso de introducir CAN
eu: Itzuli CAN sartzeko urratsera
gl: Volver ao paso de introducir CAN

# go_back_to_home.button.label
source: Go back to the start of the signing process
ca: Tornar a l'inici del procés de signatura
es: Volver al inicio del proceso de firma
eu: Itzuli sinadura prozesuaren hasierara
gl: Volver ao inicio do proceso de sinatura

# go_back_to_pin.button.label
source: Go back to PIN input step
ca: Tornar al pas d'introduir PIN
es: Volver al paso de introducir PIN
eu: Itzuli PIN sartzeko urratsera
gl: Volver ao paso de introducir PIN

# go_back.dniview.button.label
source: Cancel electronic DNI signing process
ca: Cancel·lar procés de signatura utilitzant DNI electrònic
es: Cancelar proceso de firma utilizando DNI electrónico
eu: NAN elektronikoaren sinadura prozesua bertan behera utzi
gl: Cancelar proceso de sinatura utilizando DNI electrónico

# hide_password.button.label
source: Hide password
ca: Amagar contrasenya
es: Ocultar contraseña
eu: Ezkutatu pasahitza
gl: Ocultar contrasinal

# length.numeric.textfield.hint
source: %d digits
ca: %d dígits
es: %d dígitos
eu: %d digitu
gl: %d díxitos

# length.textfield.hint
source: %d characters
ca: %d caràcters
es: %d caracteres
eu: %d karaktere
gl: %d caracteres

# mandatory_field.textfield.value
source: Mandatory field
ca: Camp obligatori
es: Campo obligatorio
eu: Derrigorrezko eremua
gl: Campo obrigatorio

# mandatory.textfield.suffix
source: (Mandatory)
ca: (Obligatori)
es: (Obligatorio)
eu: (Derrigorrezkoa)
gl: (Obrigatorio)

# opens_in_new_window.hint
source: Opens in new window
ca: Obre en finestra nova
es: Abre en ventana nueva
eu: Leiho berrian irekitzen da
gl: Abre en ventá nova

# page_control.label
source: Page selector. You are on page %d of %d. Swipe left or right to change pages.
ca: Selector de pàgina. Estàs a la pàgina %d de %d. Llisca cap a l'esquerra o dreta per canviar.
es: Selector de página. Estás en la página %d de %d. Desliza hacia la izquierda o derecha para cambiar.
eu: Orrialde hautatzailea. %d orrialdetik %d. Eskuinerantz edo ezkerrerantz irristatu aldatzeko.
gl: Selector de páxina. Estás na páxina %d de %d. Desliza cara á esquerda ou dereita para cambiar.

# pager.first.label
source: Go to first page
ca: Anar a la primera pàgina
es: Ir a la primera página
eu: Joan lehen orrialdera
gl: Ir á primeira páxina

# pager.last.label
source: Go to last page
ca: Anar a l'última pàgina
es: Ir a la última página
eu: Joan azken orrialdera
gl: Ir á última páxina

# pager.next.label
source: Go to next page
ca: Anar a la pàgina següent
es: Ir a la página siguiente
eu: Joan hurrengo orrialdera
gl: Ir á páxina seguinte

# pager.prev.label
source: Go to previous page
ca: Anar a la pàgina anterior
es: Ir a la página anterior
eu: Joan aurreko orrialdera
gl: Ir á páxina anterior

# pager.status.label
source: Page status
ca: Estat de pàgina
es: Estado de página
eu: Orrialdearen egoera
gl: Estado de páxina

# pager.status.value
source: Page %d of %d
ca: Pàgina %d de %d
es: Página %d de %d
eu: %d orrialdea %d(t)ik
gl: Páxina %d de %d

# password.textfield.label
source: Password
ca: Contrasenya
es: Contraseña
eu: Pasahitza
gl: Contrasinal

# pin.textfield.label
source: DNI PIN code
ca: Codi PIN del DNI
es: Código PIN del DNI
eu: NANaren PIN kodea
gl: Código PIN do DNI

# PRTR.image.label
source: Recovery, Transformation and Resilience Plan
ca: Pla de Recuperació, Transformació i Resiliència
es: Plan de Recuperación, Transformación y Resiliencia
eu: Berreskuratze, Eraldatze eta Erresilientzia Plana
gl: Plan de Recuperación, Transformación e Resiliencia

# show_password.button.label
source: Show password
ca: Mostrar contrasenya
es: Mostrar contraseña
eu: Erakutsi pasahitza
gl: Mostrar contrasinal

# sign_with_certificate.button.hint
source: Sign with electronic certificate
ca: Signar amb certificat electrònic
es: Firmar con certificado electrónico
eu: Sinatu ziurtagiri elektronikoarekin
gl: Asinar con certificado electrónico

# sign_with_dni.button.hint.disabled
source: Sign with electronic DNI disabled
ca: Signar amb DNI electrònic deshabilitat
es: Firmar con DNI electrónico deshabilitado
eu: Sinatu NAN elektronikoarekin desgaituta
gl: Asinar con DNI electrónico deshabilitado

# sign_with_dni.button.hint.enabled
source: Sign with electronic DNI
ca: Signar amb DNI electrònic
es: Firmar con DNI electrónico
eu: Sinatu NAN elektronikoarekin
gl: Asinar con DNI electrónico
